In [121]:
import numpy as np

# Numpy Exercises

## Ex 1

In [122]:
def inner_product(x, y):
    x = np.arrary(x)
    y = np.arrary(y)
    assert a.shape == b.shape
    return np.dot(a, b)

## Ex 2

In [123]:
def mean_absolute_error(x, y):
    x = np.arrary(x)
    y = np.arrary(y)
    assert x.shape == y.shape
    return np.mean( np.abs(y - x) )

## Ex 3

In [124]:
def lead(x, n):
    assert n >= 0
    x[ :-n] = x[n: ]
    x[-n: ] = [np.nan for i in range(n)]
    return x

In [125]:
def lag(x, n):
    assert n >= 0
    x[n: ] = x[ :-n]
    x[ :n] = [np.nan for i in range(n)]
    return x

## Ex 4

In [126]:
def distance(X, y):
    X = np.array(X)
    y = np.array(y)
    assert X.shape[1] == y.shape[0]
    return [ np.linalg.norm(X[row, :] - y, 2) for row in range(X.shape[0]) ]

# Pandas Exercises

In [127]:
import pandas as pd

## Ex 1

In [159]:
pwd

'/home/ranger/Documents/Py_Proj/Stat_Class/Assignment_1/Assignment_1_Qitian_Ma_3068020'

In [160]:
!head -n 43 'data/nycflights13/nycflights13_weather.csv'

# weather              package:nycflights13              R Documentation
#
# Hourly weather data
#
# Description:
#
#      Hourly meterological data for LGA, JFK and EWR.
#
# Usage:
#
#      weather
#
# Format:
#
#      A data frame with columns
#
#      origin Weather station. Named origin to faciliate merging with
#           ‘flights’ data
#
#      year,month,day,hour Time of recording
#
#      temp,dewp Temperature and dewpoint in F
#
#      humid Relative humidity
#
#      wind_dir,wind_speed,wind_gust Wind direction (in degrees), speed
#           and gust speed (in mph)
#
#      precip Preciptation, in inches
#
#      pressure Sea level pressure in millibars
#
#      visib Visibility in miles
#
#      time_hour Date and hour of the recording as a ‘POSIXct’ date
#
# Source:
#
#      ASOS download from Iowa Environmental Mesonet,
#      https://mesonet.agron.iastate.edu/request/download.phtml.
#
#      Hadley Wickam’s nycflights13-0.2.1 package, see http://cran.r-project.org/package=nycflights13
"origin","year","month","day","hour","temp","dewp","humid","wind_dir","wind_speed","wind_gust","precip","pressure","visib","time_hour"

In [177]:
weather = pd.read_csv('data/nycflights13/nycflights13_weather.csv', skiprows = 42)

In [178]:
weather.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,0,37.04,21.92,53.97,230.0,10.35702,11.918651,0.0,1013.9,10.0,2013-01-01 01:00:00
1,EWR,2013,1,1,1,37.04,21.92,53.97,230.0,13.80936,15.891535,0.0,1013.0,10.0,2013-01-01 02:00:00
2,EWR,2013,1,1,2,37.94,21.92,52.09,230.0,12.65858,14.567241,0.0,1012.6,10.0,2013-01-01 03:00:00
3,EWR,2013,1,1,3,37.94,23.00,54.51,230.0,13.80936,15.891535,0.0,1012.7,10.0,2013-01-01 04:00:00
4,EWR,2013,1,1,4,37.94,24.08,57.04,240.0,14.96014,17.215830,0.0,1012.8,10.0,2013-01-01 05:00:00

In [179]:
weather['temp'] = (weather['temp'] - 32) * 5/9
weather.head()

,origin,year,month,day,hour,temp,dewp,humid,wind_dir,wind_speed,wind_gust,precip,pressure,visib,time_hour
0,EWR,2013,1,1,0,2.8,21.92,53.97,230.0,10.35702,11.918651,0.0,1013.9,10.0,2013-01-01 01:00:00
1,EWR,2013,1,1,1,2.8,21.92,53.97,230.0,13.80936,15.891535,0.0,1013.0,10.0,2013-01-01 02:00:00
2,EWR,2013,1,1,2,3.3,21.92,52.09,230.0,12.65858,14.567241,0.0,1012.6,10.0,2013-01-01 03:00:00
3,EWR,2013,1,1,3,3.3,23.00,54.51,230.0,13.80936,15.891535,0.0,1012.7,10.0,2013-01-01 04:00:00
4,EWR,2013,1,1,4,3.3,24.08,57.04,240.0,14.96014,17.215830,0.0,1012.8,10.0,2013-01-01 05:00:00

In [196]:
JFK = weather[ weather['origin'] == 'JFK' ]
JFK.head()

(8711, 15)

In [199]:
JFK.groupby(['year', 'month', 'day'])['hour'].count()[JFK.groupby(['year','month', 'day'])['hour'].count() != 24]

year  month  day
2013  1      1      23
      2      21     23
      3      5      23
             31     23
      4      3      23
      8      13     23
             16     23
             19     23
             22     23
             23     22
      10     26     19
             27     23
      11     1      22
             3      19
             4      23
Name: hour, dtype: int64

In [212]:
a = JFK.groupby(['year', 'month', 'day'])['hour'].count()[JFK.groupby(['year','month', 'day'])['hour'].count() != 24]

In [215]:
a.index[0]

(2013, 1, 1)

## Ex 2

In [133]:
!head -n 55 'data/nycflights13/nycflights13_flights.csv'

# flights              package:nycflights13              R Documentation
#
# Flights data
#
# Description:
#
#      On-time data for all flights that departed NYC (i.e. JFK, LGA or
#      EWR) in 2013.
#
# Usage:
#
#      flights
#
# Format:
#
#      Data frame with columns
#
#      year,month,day Date of departure
#
#      dep_time,arr_time Actual departure and arrival times, local tz.
#
#      sched_dep_time,sched_arr_time Scheduled departure and arrival
#           times, local tz.
#
#      dep_delay,arr_delay Departure and arrival delays, in minutes.
#           Negative times represent early departures/arrivals.
#
#      hour,minute Time of scheduled departure broken into hour and
#           minutes.
#
#      carrier Two letter carrier abbreviation. See ‘airlines’ to get
#           name
#
#      tailnum Plane tail number
#
#      flight Flight number
#
#      origin,dest Origin and destination. See ‘airports’ for additional
#           metadata.
#
#      air_time Amount of time spent in the air, in minutes
#
#      distance Distance between airports, in miles
#
#      time_hour Scheduled date and hour of the flight as a ‘POSIXct’
#           date.  Along with ‘origin’, can be used to join flights data
#           to weather data.
#
# Source:
#
#      RITA, Bureau of transportation statistics, <URL:
#      http://www.transtats.bts.gov/DL_SelectFields.asp?Table_ID=236>
#
#      Hadley Wickam’s nycflights13-0.2.1 package, see http://cran.r-project.org/package=nycflights13
"year","month","day","dep_time","sched_dep_time","dep_delay","arr_time","sched_arr_time","arr_delay","carrier","flight","tailnum","origin","dest","air_time","distance","hour","minute","time_hour"

In [134]:
flights = pd.read_csv('data/nycflights13/nycflights13_flights.csv', skiprows = 54)

In [135]:
flights.head()

,year,month,day,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,2013,1,1,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,2013,1,1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,2013,1,1,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,2013,1,1,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,2013,1,1,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00

In [136]:
year_idx = flights.columns.get_loc('year')
day_idx = flights.columns.get_loc('day')
minimum = min(year_idx, day_idx)
maximum = max(year_idx, day_idx)
bet_year_day = flights.iloc[:, minimum : maximum + 1]
bet_year_day.head()

   year  month  day
0  2013      1    1
1  2013      1    1
2  2013      1    1
3  2013      1    1
4  2013      1    1

In [137]:
out_year_day = flights.iloc[:, list( range(minimum)) + list(range(maximum +1, flights.shape[1]))]
out_year_day.head()

,dep_time,sched_dep_time,dep_delay,arr_time,sched_arr_time,arr_delay,carrier,flight,tailnum,origin,dest,air_time,distance,hour,minute,time_hour
0,517.0,515,2.0,830.0,819,11.0,UA,1545,N14228,EWR,IAH,227.0,1400,5,15,2013-01-01 05:00:00
1,533.0,529,4.0,850.0,830,20.0,UA,1714,N24211,LGA,IAH,227.0,1416,5,29,2013-01-01 05:00:00
2,542.0,540,2.0,923.0,850,33.0,AA,1141,N619AA,JFK,MIA,160.0,1089,5,40,2013-01-01 05:00:00
3,544.0,545,-1.0,1004.0,1022,-18.0,B6,725,N804JB,JFK,BQN,183.0,1576,5,45,2013-01-01 05:00:00
4,554.0,600,-6.0,812.0,837,-25.0,DL,461,N668DN,LGA,ATL,116.0,762,6,0,2013-01-01 06:00:00

## Ex 3

In [138]:
pwd

'/home/ranger/Documents/Py_Proj/Stat_Class/Assignment_1/Assignment_1_Qitian_Ma_3068020'

In [139]:
!head -n 5 'data/some_birth_dates1.csv'

"Name","BirthDate"
"Paitoon Ornwimol","26.06.1958"
"Antónia Lata","20.05.1935"
"Bertoldo Mallozzi","17.08.1972"
"Nedeljko Bukv","19.12.1921"

In [140]:
A = pd.read_csv('data/some_birth_dates1.csv')

In [141]:
A.head()

                Name   BirthDate
0   Paitoon Ornwimol  26.06.1958
1       Antónia Lata  20.05.1935
2  Bertoldo Mallozzi  17.08.1972
3      Nedeljko Bukv  19.12.1921
4      Micha Kitchen  17.09.1930

In [142]:
B = pd.read_csv('data/some_birth_dates2.csv')

In [143]:
B.head()

                 Name   BirthDate
0  Hushang Naigamwala  25.08.1991
1            Zhen Wei  16.11.1975
2       Micha Kitchen  17.09.1930
3         Jodoc Alwin  16.11.1969
4          Igor Mazał  14.05.2004

In [144]:
C = pd.read_csv('data/some_birth_dates3.csv')
C.head()

                 Name   BirthDate
0         Jodoc Alwin  16.11.1969
1  Hushang Naigamwala  25.08.1991
2            Zhen Wei  16.11.1975
3       Noe Tae-Woong  11.07.1970
4    Didier Cuvillier  24.04.1938

In [145]:
A_OR_B = pd.merge(A, B, on = ['Name', 'BirthDate'], how = 'outer')

In [146]:
A_OR_B_OR_C = pd.merge(A_OR_B, C, on = ['Name', 'BirthDate'], how = 'outer')

In [147]:
A_AND_B = pd.merge(A, B, on = ['Name', 'BirthDate'], how = 'inner')

In [148]:
A_AND_C = pd.merge(A, C, on = ['Name', 'BirthDate'], how = 'inner')

In [149]:
A_name = set(A['Name'])
B_name = set(B['Name'])

In [150]:
diff_idx = A['Name'].apply(lambda name: name in (A_name - B_name))

In [151]:
A_DIFF_C = A[diff_idx]
A_DIFF_C.head()

                Name   BirthDate
0   Paitoon Ornwimol  26.06.1958
1       Antónia Lata  20.05.1935
2  Bertoldo Mallozzi  17.08.1972
3      Nedeljko Bukv  19.12.1921